
CREATE TABLE IF NOT EXISTS quran_rules (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    surah TEXT NOT NULL,
    verse_number INTEGER NOT NULL,
    rule TEXT,
    description TEXT,
    examples TEXT,
    category TEXT,
    created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP
);


INSERT INTO quran_rules (surah, verse_number, rule, description, examples, category)
VALUES ('البقرة', 56, 
        '', 
        '',
        '[]', NULL);


INSERT INTO quran_rules (surah, verse_number, rule, description, examples, category)
VALUES ('البقرة', 73, 
        '', 
        '',
        '[]', NULL);


INSERT INTO quran_rules (surah, verse_number, rule, description, examples, category)
VALUES ('البقرة', 243, 
        '', 
        '',
        '[]', NULL);


INSERT INTO quran_rules (surah, verse_number, rule, description, examples, category)
VALUES ('البقرة', 259, 
        '', 
        '',
        '[]', NULL);


INSERT INTO quran_rules (surah, verse_number, rule, description, examples, category)
VALUES ('البقرة', 260, 
        '', 
        ' مناسبة مطلع السورةخبامتتها: بدأت بوصف اإليامن:  ﱡ ﱖ ﱗ ﱘ ﱙ  ﱚ  ﱛ ﱜ  ﱝ ﱞ ﱟ ﱠ ﱡﱢﱠ  وخُتمت به:  ﱡﲇ  ﲈ ﲉ ﲊ  ﲋ ﲌ ﲍ ﲎﲏ ﲐ ﲑ ﲒ ﲓ  ﲔ  ﲕ ﲖ ﲗ ﲘ ﲙ ﲚ  ﲛﲜ ... ﲥﱠ فوافق آخرها ألوهلا من ذكر أوصاف املؤمنني ،  ثمَّ اإلشارة إىل وصف الكافرين واحلديث عن اإليامن بجميع الرسل ومجيع الكتب. [21] آية وفوائد/سورةالبقرة متشابهات وفوائد: ﱡﭐﱁ  ﭐﱠﭐﭐﭐﭐ: تكررت  يف أوائل ست سور: البقرة، آل عمران، العنكبوت، الروم، لقامن، السجدة. فوائد: أ-  ﱡﭐﱁ ﭐﱠﭐﭐ:    قال الرازي:  "احلروف تنبيهات   قُ دِّمت   عىل القرآن، ليبقى السامع مقبالً عىل استامع ما يرد عليه، فال يفوته يشء من الكالم الرائق واملعنى الفائق".',
        '[]', NULL);


INSERT INTO quran_rules (surah, verse_number, rule, description, examples, category)
VALUES ('البقرة', 136, 
        '', 
        ' الكلمة إعرابها ﱡﱠ   ﱲ  ﱠ معطوفة عىل جمرور بحرف اجلر ﱡ...ﱛ  ﱜ ﱝ...ﱠ ﱡ ﲬ  ﳆﭐﱠ معطوفة عىل منصوب بحرف  (إنَّ) الناسخ  ﱡ...ﲧ  ﲨ ﲩ...ﭐﱠ. ﱡﭐ  ﱚ  ﱛ  ﱜ  ﱝ  ﱞ   ﱟ  ﱠ  ﱡ  ﱢ  ﱣ ﱤ ﱥﱦ ﱧ   ﱨ ﱩ ﱪ ﱫ ﱬ ﱭ ﱮ ﱯ ﱰ ﱱ   ﱲ ﱳ ﱴ ﱵﱶ ... ﲋ ﱠ البقرة: 143 :سبب النزول ملا حُ وِّ لت القبلة من املسجد األقىص إىل املسجد احلرام  وكان رجال   قد  ماتوا عىل القبلة األوىل فلم ندر مانقول فيهم . فنزلت اآلية. [65] آية وفوائد/سورةالبقرة ﱡﭐﲌ   ﲍ  ﲎ  ﲏ  ﲐ  ﲑﲒ   ﲓ  ﲔ  ﲕﲖ  ﲗ  ﲘ  ﲙ ﲚ   ﲛﲜ  ﲝ  ﲞ  ﲟ  ﲠ  ﲡ  ﲢﲣ  ﲤ  ﲥ   ﲦ ﲧ ﲨ ﲩ ﲪ ﲫ ﲬﲭ ﲮ ﲯ ﲰ  ﲱ ﲲ ﲳ ﱠ البقرة:  144',
        '[]', NULL);


INSERT INTO quran_rules (surah, verse_number, rule, description, examples, category)
VALUES ('البقرة', 3, 
        '', 
        ' ﱡﱩ ﱠﭐﭐﭐ؟ آية  البقرة:  أتت يف موضوع حتويل  القبلة وهو أمر أحدث فتنة و بلبلة فاقتىض ذلك إظهار اهلل لنفسه بذكر الياء ومل حيتاج ملثل ذلك يف املوطنني اآلخرين. [ بالغة الكلمة / للسامرائي[ [68] آية وفوائد/سورةالبقرة ﱡﭐﲥ  ﲦ  ﲧ ﲨ ﲩ   ﲪ ﲫ ﲬ ﲭ ﲮ ﲯ ﲰ ﲱ ﲲ ﲳ  ﲴ ﲵ ﲶ ﱠ البقرة:  151 مناسبة اآلية: ملا ذكر اهلل   عزوجل  يف اآلية السابقة   إنعامه عىل املسلمني باستقبال الكعبة وإمتامها بالرشائع  لقوله:  ﱡﭐﲟ  ﲠ ﲡ ﲢ  ﲣ ﲤ ﭐﭐﭐﭐﭐﱠﭐذكر  هنا  متمامت النعم إرسال الرسول صىل اهلل عليه وسلم وإنزال كتابه. ] السعدي[ ﱡﭐ  ﲷ  ﲸ ﲹ ﲺ ﲻ ﲼ ﲽ ﱠ البقرة:  152',
        '[]', NULL);


INSERT INTO quran_rules (surah, verse_number, rule, description, examples, category)
VALUES ('البقرة', 164, 
        '', 
        ' ملا ذكر اهلل  سبحانه   وتعاىل  التوحيد بقوله:  ﱡﭐﳉ  ﳊ ﳋﳌ ﳍ ﳎ ﳏ ﳐ ﳑ ﳒﳓﱠ  البقرة:  163   عقب ذلك بالدليل الدّال   عىل  وحدانيته عزوجل. ] ( الشوكاين1/ 188 ( )، الرازي4/ 152)[ :توجيه املتشابه آية البقرة: ذكرت السبب الذي يكون منه (الرزق )  وهو (املاء). آية الجاثية: ذكرت املُسَبَّب عن (املاء) وهو (الرزق). ﱡﭐ  ﱭ  ﱮ ﱯ ﱰ ﱱ ﱲ  ﱳ ﱴ ﱵ ﱶ ﱷﱸ  ﱹ ﱺ ﱻ ﱼ ﱽﱾ ﱿ ﲀ ﲁ ﲂ ﲃ ﲄ   ﲅ ﲆ  ﲇ ﲈ ﲉ ﲊ ﲋ  ﲌ ﲍ ﲎ  ﱠ البقرة: 165 الضبط: ﱡﭐﲌﲍ ﱠ  خامتة وحيدة يف املصحف  وباقي املصحف  ﱡ ﱔ ﱕﱠ. عندما توعد  اهلل  عزوجل  ﱡﲁ   ﲂ  ﲃ  ﲄ  ﲅﱠﭐﭐأي: يوم القيامة',
        '[]', NULL);


INSERT INTO quran_rules (surah, verse_number, rule, description, examples, category)
VALUES ('البقرة', 4, 
        '', 
        ' 2 - 3 -  التوبة والتطهر البقرة : ﱡﭐ... ﲠ  ﲡ ﲢ ﲣ ﲤ ﲥ  ﲦﲧ ﲨ  ﲩ ﲪ ﲫ ﲬ ﲭ ﲮ ﱠ التوبة: ﱡﭐ... ﱭ ﱮ ﱯ ﱰ ﱱﱲ  ﱳ ﱴ ﱵﱶﱠ 4 - اإلحسان وردت يف مخسة مواضع: البقرة : ﱡﭐﲐ   ﲑ ﲒ ﲓ ﲔ ﲕ ﲖ ﲗ ﲘ ﲙ ﲚ ﲛ ﲜ  ﲝ ﲞ ﲟﱠﭐ ﭐآل عمران  134 ، 148واملائدة   13  ،93 . 5 - الصرب آل عمران: ﱡ...  ﲫ ﲬ  ﲭ ﲮﲯ ﲰ ﲱ ﲲﲳ ﱠ [177] آية وفوائد/سورةآل عمران الصفة اآلية 6 - التوكل آل عمران: ﱡﭐ...  ﱝ ﱞ ﱟﱠ ﱡ ﱢ  ﱣ ﱤ ﱥﱦ ﱧ  ﱨ ﱩ ﱪﱫ ﱠ 7 - القسط وردت يف ثالثة مواضع: املائدة: ﱡﭐ... ﱕ ﱖ ﱗ ﱘ ﱙﱚ  ﱛ ﱜ ﱝ ﱞﱟ ﱠﭐﭐ احلجرات 9   واملمتحنة8 . 8 -  االعتدال يف الصفوف الصف: ﱡﭐﲝ  ﲞ ﲟ ﲠ ﲡ ﲢ ﲣ ﲤ',
        '[]', NULL);


INSERT INTO quran_rules (surah, verse_number, rule, description, examples, category)
VALUES ('البقرة', 153, 
        '', 
        '',
        '[]', NULL);


INSERT INTO quran_rules (surah, verse_number, rule, description, examples, category)
VALUES ('البقرة', 180, 
        '', 
        ' اخلاء يف ﱡﲲ ﱠ. ﱡﭐ ﲕ  ﲖ  ﲗ ﲘ   ﲙ  ﲚ ﲛ ﲜ  ﲝ ﲞ ﲟ ﲠ ﲡﲢ ﲣ ﲤ ﲥ ﲦﲧ ﲨ ﲩ ﲪ ﲫ ﲬ ﱠ آل عمران: 155 أتى اخلتام باسمي اهلل عزوجل ﱡﲎ   ﲏ ﱠ يف املصحف أربع مرات: 1-  البقرة: ﭐ o ﱡﱁ  ﱂ ﱃ ﱄ ﱅ  ﱆ ﱇ ﱈ ﱉ ﱊ  ﱋﱌ ﱍ ﱎ ﱏ ﱐ ﱠ o ﱡﭐﱝ  ﱞ ﱟ ﱠ  ﱡ  ﱢ ﱣ ﱤ  ﱥ  ﱦ  ﱧ  ﱨ ﱩﱪ ...  ﲂ ﲃ ﲄ  ﲅ ﲆ ﲇ ﲈ ﲉﲊ ﲋ  ﲌ ﲍ ﲎ  ﲏ  ﲐ ﱠﭐ 2-  آل عمران:  ﱡﲕ  ﲖ ﲗ  ﲘ  ﲙ ﲚ  ﲛ ﲜ  ﲝ ﲞ  ﲟ ﲠ   ﲡﲢ ﲣ ﲤ ﲥ ﲦﲧ ﲨ  ﲩ ﲪ ﲫ ﲬﱠ 3-  املائدة:  ﱡﭐﲞ  ﲟ  ﲠ  ﲡ ﲢ   ﲣ  ﲤ  ﲥ ﲦ  ﲧ  ﲨ ﲩ ﲪ ﲫ ﲬ ﲭ  ﲮ ﲯ ﲰ ﲱ  ﲲ ﲳﲴ ﲵ  ﲶ ﲷ ﲸ ﱠ [183] آية وفوائد/سورةآل عمران ﭐﱡﭐ ﲁ ﲂ ﲃ ﲄ  ﲅﲆ ﲇ ﲈ ﲉ ﲊ ﲋ ﲌ ﲍﲎ ﲏ ﲐ ﲑ  ﲒ ﲓ',
        '[]', NULL);


INSERT INTO quran_rules (surah, verse_number, rule, description, examples, category)
VALUES ('البقرة', 24, 
        '', 
        ' الآية الأولى في النسا ء:  ﱡﭐﱖ  ﱗ ﱘﱠﭐبحذف قول ه:  ﱡﲔ ﲕ  ﲖﱠ ألنَّ هذه اآلية جاءت  يف حق احلرائر املسلامت. الآية الثانية في النساء: ﱡﭐﲑ  ﲒ ﲓ  ﲔ ﲕ   ﲖ ﭐﱠ ألنَّ هذه اآلية جاءت  يف حق اجلواري (اإلماء). [215] آية وفوائد/سورةالنساء أم ّا  آية المائدة:ﭐﱡﭐﳃ   ﳄ ﳅ  ﳆ ﳇ ﳈﱠ  فجاءت يف حق الكتابيات. فذَكر التحذير من اختاذ األخدان يف حال اإلماء والكتابيات، ومل يذكرها يف حال احلرائر املسلامت، تنبيهًا عىل أهنَنَّ إىل العفة أقرب، ومن اخليانة والرذيلة أبعد، وألهننَّ ال يشبهنَّ اإلماء والكتابيات يف اختاذ األخدان (هم األخالء الذين يزنون هبنَّ رسَّاً).',
        '[]', NULL);


INSERT INTO quran_rules (surah, verse_number, rule, description, examples, category)
VALUES ('البقرة', 33, 
        '', 
        ' ملا قال تعاىل :  ﭐﱡﭐﲏ  ﲐ ﲑ ﲒ ﲓ ﲔ ﲕ ﲖ ﲗ ﱠ  عطف عليها ﭐﱡﭐﲯ  ﲰ  ﲱ ﲲ ﲳ  ﲴ ﲵﱠ  اعتبار كونِه جامعًا ملعنى النَّهي عن  الطَّمعِ يف مال صاحب املال، قُصِد منها استكاملُ تبينيِ مَن هلم حقٌّ يف املال. ] ابن عاشور[ ﱡﭐ ﱁ ﱂ ﱃ ﱄ ﱅ ﱆ ﱇ ﱈ   ﱉ ﱊ ﱋ ﱌ ﱍ ﱎﱏ ﱐ   ﱑ ﱒ ﱓ ﱔ ﱕ ﱖﱗ ﱘ ﱙ ﱚ ﱛ ﱜ ﱝ ﱞ   ﱟﱠ ﱡ ﱢ ﱣ ﱤ ﱥ ﱦﱧ  ﱨ ﱩ ﱪ ﱫ  ﱬ ﱭ ﱠ النساء:  34 :مناسبة ختام اآلية مناسبة ختم اآلية هبذين  االسمني  ﱡﱫ  ﱬﱠ:  أنَّ   املقصود منه هتديد األزواج من ظلم النساء. [218] آية وفوائد/سورةالنساء -  واملعنى أهننَّ   إنْ   ضعفن عن دفع ظلمكم وعجزن عن االنتصاف منكم، فاهلل',
        '[]', NULL);


INSERT INTO quran_rules (surah, verse_number, rule, description, examples, category)
VALUES ('البقرة', 99, 
        '', 
        ' ﱡﭐ ﲩ  ﲪ  ﲫ ﲬ ﲭ ﲮ  ﲯ ﲰ  ﲱ ﲲ ﲳ ﲴﲵ  ﲶ  ﲷ ﲸ ﲹ  ﲺ ﲻ ﲼ ﲽ ﲾ ﲿ ﳀ  ﳁ ﳂ ﳃ ﳄ ﳅﳆ ﳇ ﳈ ﳉ ﳊ ﳋﱠ النساء: 100 :اآلية تسمى آية اهلجرة. سبب النزول: عن ابن عبا س ريض اهلل عنه   قال: خرج ضمرة بن جندب من بيته مهاجراً ، فقال ألهله: امحلوين، فأخرجوين من أرض املرشكني إىل رسول اهلل صىل اهلل عليه وسلم ، فامت يف الطريق قبل أن يصل إىل النبي فنزلت اآلية. ] السلسلة الصحيحة[ [240] آية وفوائد/سورةالنساء ﱡﭐ ﳌ ﳍ  ﳎ  ﳏ ﳐ ﳑ ﳒ ﳓ ﳔ ﳕ ﳖ ﳗ ﳘ  ﳙ ﳚ ﳛ ﳜﳝ ﳞ ﳟ ﳠ ﳡ ﳢ ﳣ  ﳤ  ﱠ  النساء: 101 :اآلية تسمى آية قرص الصالة. مناسبة اآلية: ملا ذَ كرت اآليات السابقة اهلجرة والسفر يف سبيل اهلل، ذَ كر هنا رخصة قرص الصالة',
        '[]', NULL);


INSERT INTO quran_rules (surah, verse_number, rule, description, examples, category)
VALUES ('البقرة', 128, 
        '', 
        ' [245] آية وفوائد/سورةالنساء ﱡﱻ  ﱼ  ﱽ  ﱾ  ﱿ   ﲀ  ﲁﲂ  ﲃ  ﲄ  ﲅ  ﲆﲇ  ﱠ النساء: 130 :الضبط موضع وحيد يف املصحف ] قاعدة العناية باآلية الوحيدة[ . -  ألنَّ السعة أمر واسع ختمهاباسمه (الواسع). ﱡﲸ  ﲹ ﲺ ﲻ ﲼ ﲽ ﲾﲿ ﳀ  ﳁ ﳂ  ﳃ ﳄ ﳅ ﱠ النساء: 133 املتشابه الضبط ﱡﭐﲸ  ﲹ ﲺ ﲻ ﲼﭐﱠ موضع وحيد بزيادة لفظ   ﱡﭐﲻ  ﲼﱠﭐوباقي املواضع    ﱡﲸ  ﲹ ﲺﱠ  يف األنعام 133   ،  إبراهيم19  ،  فاطر16 . نربط زيادة لف ظ  ﱡﭐﲻ  ﲼ ﱠﭐ  مع أول السورة   ﱡﭐﱁ  ﱂ ﱃ ﱄ ﱟ ﱠ ] قاعدة  املوافقة بني املوضع املتشابه وأول السورة[ ﱡﭐﳀ   ﳁ ﳂ ﳃ ﳄﱠ موضع وحيد  يف القرآن',
        '[]', NULL);


INSERT INTO quran_rules (surah, verse_number, rule, description, examples, category)
VALUES ('البقرة', 3, 
        '', 
        ' ﱡﱩ ﱠ ؟ يف البقرة أتت يف موضوع حتويل القبلة وهو أمر أحدث فتنة وبلبلة فاقتىض ذلك إظهار اهلل لنفسه بذكر الياء ومل حيتاج ملثل ذلك يف املوطنني اآلخرين. ] بالغة الكلمة / للسامرائي[ :فوائد أ-  اآلية قال   عنها  أحد اليهود لعمر ريض اهلل عنه  : لو نزلت علينا  الختذنا ذلك اليوم عيدً ا، فقال عمر:  "واهلل إين ألعلم متى نزلت، نزلت يوم عرفة يوم اجلمعة ". ب -  آية  عظيمة نزلت عىل النبي صىل اهلل عليه وسلم   يوم عرفة يف حجة الوداع، بركت ناقته هيبة وإجالالً هلذه اآلية. [273] آية وفوائد/سورةالمائدة ت -  ﱡﱫ  ﱬ  ﱭ  ﱮﭐﱠﭐﭐﭐﭐبكى عمر ملا نزلت فقيل له ما يبكيك؟ قال :  ما اكتمل',
        '[]', NULL);


INSERT INTO quran_rules (surah, verse_number, rule, description, examples, category)
VALUES ('البقرة', 41, 
        '', 
        ' باآلية[ . فوائد: أ-  نقض العهود مع اهلل عزوجل   من املعايص ويؤدي إىل:  قسوة القلب، نسيان العلم. ب -  سُ ئل عبداهلل بن مسعود ريض اهلل عنه : هل ينسى العبد العلم بالذنب يصيبه؟ قال: أومل تسمع قوله تعاىل: ﱡﭐﱁ  ﱂ  ﱃﭐﱠﭐ. [283] آية وفوائد/سورةالمائدة ﱡﭐ ﱁ ﱂ ﱃ ﱄ ﱅ ﱆ ﱇ   ﱈ ﱉ ﱊ ﱋ ﱌ ﱍ ﱎ ﱏ   ﱐ ﱑ ﱒ ﱓﱔ ﱕ ﱖ ﱗ ﱘ ﱙ ﱚ ﱛ ﱠ املائدة: 14 :فوائد',
        '[]', NULL);


INSERT INTO quran_rules (surah, verse_number, rule, description, examples, category)
VALUES ('البقرة', 7, 
        '', 
        '',
        '[]', NULL);


INSERT INTO quran_rules (surah, verse_number, rule, description, examples, category)
VALUES ('البقرة', 12, 
        '', 
        ' ب -  ﱡﱍ  ﱎ ﱏ  ﱐﱠﭐ  أ فسد العايص ما بينه وبني اهلل فنزلت العقوبة فساد بني العايص والناس "اجلزاء من جنس العمل  ". ت -  قال ابن تيمية: متى ترك الناس بعض ما أمرهم اهلل به وقعت بينهم العداوة. ﱡﱜ  ﱝ   ﱞ  ﱟ  ﱠ  ﱡ  ﱢ  ﱣ  ﱤ ﱥ ﱦ ﱧ ﱨ ﱩ ﱪ  ﱫﱬ ﱭ ﱮ  ﱯ ﱰ ﱱ ﱲ  ﱳ ﱴ ﱠ املائدة:  15 ﱡ ﱥ ﱦ  ﱧ ﱨ   ﱩ ﱪ ﱫ ﱬ ﱭ ﱮ ﱯ ﱰ ﱱ ﱲ ﱳ ﱴ ﱵ ﱶ ﱷﱸ ﱹ ﱺ ﱻ ﱼﱽ ﱾ ﱿ ﲀ  ﲁ ﲂ ﲃ ﱠ املائدة: 19 [284] آية وفوائد/سورةالمائدة ﱡﲈ  ﲉ  ﲊ  ﲋ  ﲌ  ﲍ  ﲎ  ﲏ   ﲐ  ﲑﲒ  ﲓ  ﲔ ﲕ ﲖ  ﲗ ﲘ ﲙ  ﲚ   ﲛ  ﲜ ﲝ ﲞ ﲟ  ﲠ ﲡ ﲢ   ﲣ  ﲤﲥ  ﲦ  ﲧ  ﲨ  ﲩ   ﲪ  ﲫﲬ  ﲭ  ﲮ ﲯﲰ ﲱ ﲲ ﲳ ﲴ ﲵ ﲶ  ﱠ املائدة:  17',
        '[]', NULL);


INSERT INTO quran_rules (surah, verse_number, rule, description, examples, category)
VALUES ('البقرة', 11, 
        '', 
        ' خامتة مهمة حيصل فيها اللبس كثرياً لذا حرصها يزيل هذا اللبس بإذن اهلل. [308] آية وفوائد/سورةالمائدة ﱡﭐ ﲋ ﲌ ﲍ  ﲎ ﲏ ﲐ ﲑ ﲒ ﲓ ﲔ ﲕﲖ  ﲗ ﲘ ﲙ ﲚ ﲛ ﲜ ﲝ ﲞ  ﲟ ﲠ ﲡ ﲢ ﲣ ﲤﲥ ﲦ ﲧ ﲨ ﲩ   ﲪ ﲫﲬ ﲭ ﲮ ﲯ ﲰ ﲱﲲ ﲳ   ﲴﲵ ﲶ ﲷ ﲸ ﲹ  ﲺ ﲻ ﲼ ﲽ  ﱠ املائدة:  89 مناسبة اآلية: ملا ذكر سابقًا حتريمهم للحالل وهو يعدُّ يف الرشيعة اإلسالمية يمينًا، بنيَّ اهلل تعاىل هنا أحكام األيامن وكفارهتا. تكرر قوله تعاىل:  ﱡﲁ  ﲂ  ﲃ ﲄ ﲅ...ﱠ  يف أربعة مواضع: 1- البقرة: ﱡﭐﲁ   ﲂ  ﲃ ﲄ ﲅ  ﲆ ﲇ ﲈ ﱠ 2- آل  عمران:  ﱡﭐ... ﱻ  ﱼﱽﱾﱿ ﲀ ﲁ  ﲂ  ﲃ ﲄﲅ ﱠ 3- املائدة:  ﱡﭐ... ﲳ  ﲴﲵ ﲶ ﲷ ﲸ ﲹ ﲺ ﲻ ﲼﲽ ﱠ',
        '[]', NULL);


INSERT INTO quran_rules (surah, verse_number, rule, description, examples, category)
VALUES ('البقرة', 159, 
        '', 
        ' [371] آية وفوائد/سورةالأنعام ﱡﭐ ﳇ ﳈ ﳉﳊ ﳋ ﳌ ﳍ ﳎ  ﳏ ﳐ ﳑ ﳒﳓ ﳔ ﳕ ﳖﳗ ﳘ ﳙ ﳚ ﳛ ﳜ  ﱠ األنعام:  101 ﱡﭐ ﲥ ﲦ ﲧﲨ  ﲩ ﲪ ﲫ ﲬ ﲭ ﲮ ﲯ ﲰ ﲱ ﱠ البقرة: 117 ﱡﭐ ﱁ ﱂ ﱃﱄ ﱅ ﱆ ﱇ ﱈﱉ ﱊ ﱋ ﱌ  ﱍﱎ ﱏ ﱐ ﱑ ﱒ ﱓ ﱔ ﱠ  األنعام:  102 ﱡ ﱲ  ﱳ ﱴ ﱵ ﱶ ﱷ ﱸ ﱹ ﱺ ﱻﱼ ﱽ  ﱾ  ﱿ ﱠ غافر:62 :توجيه املتشابه ملَ قدّم   ﱡﭐﱅ ﱆ ﱇ ﱈﱠ يف سورة األنعام وقدّم  ﱡﭐﱵ  ﱶ ﱷ ﱠ يف غافر؟ في سورة  الأنعام:  ذكر يف اآلية السابقة من ادعى هلل الرشكاء والولد  ﱡﭐﲵ ﲶ ﲷ ﲸ ﲹﲺ  ﲻ ﲼ ﲽ ﲾ ﲿ ﳀﳁ ... ﳆﱠ  فقدَّم فيها ذكر ما يبطل قوهلم وهو شهادة الوحدانية ﱡﭐﱅ ﱆ ﱇ ﱈﱠ. أما في سورة غافر   فذكر قبلها  اخللق:  ﱡﭐﲢ ﲣ ﲤ ﲥ',
        '[]', NULL);


INSERT INTO quran_rules (surah, verse_number, rule, description, examples, category)
VALUES ('البقرة', 60, 
        '', 
        ' (كفروا أواستكربوا). [422] آية وفوائد/سورةالأعراف - قصة صالح وشعيب عليهام السالم يف سورة األعراف أتت بلفظﭐﱡﭐﱂ ﱃ ﱄ ﱅﭐﱠ - باقي املواضع يف املصحف أتت بلفظ ﱡﭐﲊ ﲋﭐﱠ.',
        '[]', NULL);


INSERT INTO quran_rules (surah, verse_number, rule, description, examples, category)
VALUES ('البقرة', 90, 
        '', 
        '',
        '[]', NULL);


INSERT INTO quran_rules (surah, verse_number, rule, description, examples, category)
VALUES ('البقرة', 88, 
        '', 
        ' ﱡﭐﲙ ﲚ ﲛ ﲜ ﲝ ﲞ ﲟ ﲠ ﲡ  ﲢﲣ ﲤ ﲥ ﲦ ﲧ ﲨﱠ األعراف:  64 :املواضع املتشابهة 1-  األعراف o ﱡﭐﲙ ﲚ ﲛ ﲜ ﲝ ﲞ ﲟ ﲠ ﲡ  ﲢﲣ ﲤ ﲥ ﲦ ﲧ ﲨﱠ o ﱡﭐﲕ ﲖ ﲗ ﲘ ﲙ  ﲚ ﲛ ﲜ ﲝ ﲞﲟ ﲠ ﲡ ﲢ ﲣﱠ 2- هود: o ﱡﭐﲉ ﲊ ﲋ ﲌ ﲍ ﲎ ﲏ ﲐ ﲑ  ﲒ ﲓ ﲔ ﲕ ﲖ ﲗﱠ o ﱡﭐﱺ ﱻ ﱼ ﱽ ﱾ ﱿ ﲀ ﲁ ﲂ ﲃ  ﲄ ﲅ ﲆﲇ ﲈ ﲉ ﲊ ﲋ ﲌ ﲍﱠ [423] آية وفوائد/سورةالأعراف o ﱡﭐﲠ ﲡ ﲢ ﲣ ﲤ ﲥ ﲦ ﲧ ﲨ ﲩ ﲪ  ﲫ ﲬ ﲭ ﲮ ﲯ ﲰ ﲱ ﲲﱠ 3- يونس:   ﱡﱷ ﱸ ﱹ ﱺ ﱻ ﱼ ﱽ ﱾ  ﱿ ﲀ ﲁ ﲂﲃ ...ﲉﱠ 4- الشعراء: o ﱡﭐﱥ ﱦ ﱧ ﱨ ﱩ ﱪﱠ o ﱡﭐﱵ ﱶ ﱷ ﱸ ﱹ ﱺ  ﱻﱠ الضبط: - اللفظ يف األعراف  ﱡﲛ ﲜﭐﱠ أقرص من هود ﱡﱿ ﲀ ﲁﭐﱠ قاعدة: [ األعراف مبنية عىل االختصار]  .',
        '[]', NULL);


INSERT INTO quran_rules (surah, verse_number, rule, description, examples, category)
VALUES ('البقرة', 117, 
        '', 
        ' - أما يف يونس فلم يذكر أنه أظهر آيةً أمام فرعون وملئه، وإنام قال:   (فلام جاءهم احلق من عندنا قالوا إن هذا لسحر مبني) يونس 76. [439] آية وفوائد/سورةالأعراف',
        '[]', NULL);


INSERT INTO quran_rules (surah, verse_number, rule, description, examples, category)
VALUES ('البقرة', 80, 
        '', 
        ' تلقف ما يأفكون.  فلام مل  يكن االهتامم بذكر اآليات يف يونس  -كام يف األعراف - أخرها، بخالف ما ورد يف األعراف. فناسب كل تعبري موضعه. أسئلة بيانية يف القرآن الكريم اجلزء الثاين[93[ ﱡﭐ ﱯ ﱰ ﱱ ﱲ ﱳ ﱴ ﱵ ﱶ  ﱷ ﱸ ﱠ األعراف: 109 ﱡﭐ ﲲ ﲳ ﲴ ﲵ ﲶ ﲷ  ﲸ ﲹ ﱠ  الشعراء:  34 مقارنة بني قصة موسى يف سورتي األعراف والشعراء تبني االختصار يف سورة األعراف سورة الشعراء سورة األعراف ﱡﲲ ﲳ ﲴ ﲵ ﲶ ﲷ  ﲸ ﲹ ﭐﲺﲻﲼ  ﲽ ﲾﲿ ﳀﳁ ﳂﱠ ﱡﭐﱯ ﱰ ﱱ ﱲ ﱳ ﱴ ﱵ ﱶ   ﱸ ﱹ ﱺ ﱻ ﱼ ﱽﱾ ﱿ ﲀ ﲁ ﱠ ﱡﳃ ﳄ ﳅ ﳆ ﳇ ﳈ ﳉ  ﳊﱠ ﱡﭐ ﲂ ﲃ ﲄ ﲅ ﲆ ﲇ ﲈ ﲉ ﱠﭐ (وأرسل): لكثرة دوران كلمة اإلرسال يف',
        '[]', NULL);


INSERT INTO quran_rules (surah, verse_number, rule, description, examples, category)
VALUES ('التوبة', 10, 
        '', 
        ' وحرصت عىل توجيه طالبايت هلذا الفهم،  وأننا نت عامّل مع معاين القرآن وليس حروفه،  واحلرص ال يكون إال ملِا اشتبه علينا لفظه ومل نجد معنى لربطه. - حرصت أن أقيد املواضع األقّل يف اللفظ املتشابه  ختفيفا عىل احلافظ،  إلن تعداد وحرص املواضع األقّل يُعني احلافظ عىل ضبط باقي املواضع املتشاهبة. - قمت بتلوين املوضع املتشاب ه باللون األمحر ليسهّل عىل القارئ مالحظته. ما يميز الكتاب وهلل احلمد :  أنه الكتاب الوحيد الذي يضع بني يدي احلافظ عدة معلومات يف علوم مت نوعة تتعلق باآلية يف صفحة واحدة،  حتى يتشبع املعلم والطالب بكّل ما يتعلق باآلية من معلومات.',
        '[]', NULL);


INSERT INTO quran_rules (surah, verse_number, rule, description, examples, category)
VALUES ('التوبة', 4, 
        '', 
        '  الصفة الثانية والثالثة: التوبة والتطهر - البقرة  ﱡ ... ﲠ ﲡ ﲢ ﲣ ﲤ ﲥ ﲦﲧ ﲨ ﲩ ﲪ ﲫ ﲬ ﲭ ﲮﱠ - التوبة  ﱡ... ﱭ ﱮ ﱯ ﱰ ﱱﱲ ﱳ ﱴ ﱵ ﱶﱠ  : الصفة الرابعة: اإلحسان، وردت يف مخسة مواضع -  البقرة ﱡﲐ ﲑ ﲒ ﲓ ﲔ ﲕ ﲖ ﲗ ﲘ ﲙ ﲚ ﲛ ﲜ ﲝ ﲞ ﲟﱠ -  آل عمران :  1 3 4  ، 1 4 0 ، املائدة :  13  ، 93 .  الصفة اخلامسة: الصرب -  آل عمران  ﱡ... ﲫ ﲬ ﲭ ﲮﲯ ﲰ ﲱ ﲲ ﲳ ﱠ  الصفة السادسة: ا لتوكّل - آل عمران :  ﱡ... ﱝ ﱞ ﱟﱠ ﱡ ﱢ ﱣ ﱤ ﱥﱦ ﱧ ﱨ ﱩ ﱪ ﱫﱠ آية وفـــــــــــــــــــــــ وائد 01  سورة اتلوبة  : الصفة السابعة: القسط، وردت يف ثالثة مواضع - املائدة :  ﱡ...ﱕ ﱖ ﱗ ﱘ ﱙﱚ ﱛ ﱜ ﱝ ﱞ ﱟﱠ',
        '[]', NULL);


INSERT INTO quran_rules (surah, verse_number, rule, description, examples, category)
VALUES ('التوبة', 28, 
        '', 
        ' ﲧ ﲨ ﲩ ﲪ ﲫ ﲬ ﲭ ﲮ ﲯ ﲰ ﲱﲲ ...ﲽ ﱠ. وجاء بعده يف التوبة يف موضعني:  ﱡﱁ  ﱂ ﱃ ﱄ ﱅ ﱆ ﱇ ﱈ ﱉﱊ ... ﱑﱠ   ﱡﱝ ﱞ ﱟﱠﱡ ﱢ ﱣ ﱤ ﱥ ﱦ ﱧ ﱨ ﱩ ﱪ...ﱺﱠ ليعلم أن األصّل ذلك، وإنام ههنا ملوافقة ما قبله فحسب. [  أرسار التكرار يف القرآن 243 ] آية وفـــــــــــــــــــــــ وائد 09  سورة اتلوبة  ﱡﱌ ﱍ ﱎﱏ ﱐ ﱑ ﱒ ﱓ ﱔ ﱕﱠ  [  :التوبة 11 .] - ﱡ ﱌ ﱍ ﱎﱏ ﱠ ذكرت  يف  أحد عرش موضع ا يف املصحف –  سواء كان احلديث عن اجلنة أو النا ر–: 1-  ثالثة مواضع يف سورة النساء  ﱡﲐ ﲑ ﲒ ﲓ ﲔ ﲕ ﲖ ﲗ ﲘ ﲙ ﲚ ﲛ ﲜﲝ... ﲦﱠ  ﱡﱁ ﱂ ﱃ ﱄ ﱅ ﱆ ﱇ ﱈ ﱉ ﱊ ﱋ ﱌ ﱍﱎ ﱏ ﱐ ﱑﱒ ﱓ ﱔ ﱕ ﱖ ﱗ ﱘﱠ',
        '[]', NULL);


INSERT INTO quran_rules (surah, verse_number, rule, description, examples, category)
VALUES ('التوبة', 27, 
        '', 
        '',
        '[]', NULL);


INSERT INTO quran_rules (surah, verse_number, rule, description, examples, category)
VALUES ('التوبة', 15, 
        '', 
        ' من اهلل    فختمها ﱡ  ﱗ ﱘ ﱙﱠ .  ﱡﱏ ﱐ ﱑ ﱒ ﱓ ﱔ ﱕ ﱖ ﱗ ﱘ ﱙ ﱚ ﱛﱜ  ﱝ  ﱞ  ﱟﱠﱡ  ﱢ  ﱣ  ﱤ  ﱥ  ﱦﱧ  ﱨ  ﱩ  ﱪ ﱫ ﱬﱠ   [  :التوبة 1٢. ] آية وفـــــــــــــــــــــــ وائد 10  سورة اتلوبة قوله :  ﱡﱥ ﱦﱧﱠ تعليق لإلغناء باملشيئة ، ألن الغنى يف الدنيا ليس من لوازم اإليامن، وال يدل عىل حمبة اهلل، ويف  احلديث: « إن اهلل يعطي الدنيا من حي ب ومن ال حيب، وال يعطي اإليامن إال من أحب »  السلسلة الصحيحة . [  املجالس القرآنية 2٢1 ] :تنبيه كّل ما يتعلق بمتشابه خواتيم آيات سورة التوبة ينظر له يف اجلدول يف آخر السورة.  ﱡﱭ ﱮ ﱯ ﱰ ﱱ ﱲ ﱳ ﱴ ﱵ ﱶ ﱷ ﱸ ﱹ',
        '[]', NULL);


INSERT INTO quran_rules (surah, verse_number, rule, description, examples, category)
VALUES ('التوبة', 9, 
        'بدأت اآليتان هبمزة استفهام  ﱡ  ﲢ ﲣ،', 
        ' آية وفـــــــــــــــــــــــ وائد 10  سورة اتلوبة  ﱡﱏ ﱐ ﱑ ﱒ ﱓ ﱔ ﱕ ﱖ ﱗ ﱘ ﱙ ﱚ ﱛ ﱜ ﱝﱞ ﱟﱠﱡ ﱢ ﱣ ﱤ ﱥ ﱦ ﱧﱨ ﱩ ﱪ ﱫ ﱬ ﱭﱮ ﱯ ﱰ ﱱ ﱲ ﱳ ﱴ ﱵ ﱶ ﱷﱸ ﱹ ﱺ ﱻ ﱼ ﱽ ﱾ ﱿ ﲀ ﲁﱠ [  :التوبة 13 .] -  ذكر العذاب مع مجلة ﱡﱵ ﱶ ﱷﱠيف ثالثة مو اضع: 1- التوبة :  ﱡ ... ﱯ ﱰ ﱱ ﱲ ﱳ ﱴ ﱵ ﱶ ﱷﱸ ﱹ ﱺ ﱻ ﱼ ﱽﱾ ﱿ ﲀ ﲁﱠ 2- آل عمران :  ﱡ ﱳ ﱴ ﱵ ﱶ ﱷ ﱸ ﱹﱺ ﱻ ﱼﱽﱾﱿ ﲀﱠ 3- النور :  ﱡ ﳂ ﳃ ﳄ ﳅ ﳆ ﳇ ﳈ ﳉ ﳊ ﳋ ﳌ ﳍ ﳎ ﳏ ﳐﳑ ...ﳗﱠ آية التوبة املوضع الوحيد الذي أتى فيه لفظ اجلاللة ﱡ ﱱ ﱲ ﱳﱠ  ﱡﲶ  ﲷ  ﲸ  ﲹ  ﲺ  ﲻ  ﲼ  ﲽ  ﲾ  ﲿ  ﳀ ﳁ ﳂ ﳃ ﳄ ﳅ ﳆ ﳇ ﳈ ﳉ ﳊﱠ [  :التوبة 1 2 ] . :سبب النزول',
        '[]', NULL);


INSERT INTO quran_rules (surah, verse_number, rule, description, examples, category)
VALUES ('التوبة', 24, 
        'كلمة  ﱡ  ﱅ ﱠ  مناسبة مع خامتة اآلية.', 
        ' ﱰ ... ﱵ ﱶ ﱷ ﱸ ﱹ ... ﲇ ﲈ ﲉ ﲊ ﲋ ﲌ ﲍ ﱠ وهبام حرف السني وختمت اآلية بكلمة هبا نفس احلرف ﱡ ﲌ ﱠ *** 2- ﱡﱁ ﱂ ﱃ ﱄ ﱅ ﱆ ﱇ ﱈ ﱉ ﱊ ﱋ ﱌ ﱍ ﱎ ﱏﱐ ... ﱗ ﱘ ﱙ ﱚ ﱛ ﱜ ﱠ اآلية بكلمة هبا نفس احلرفني  ﱡ ﲌ ﱠ آية وفـــــــــــــــــــــــ وائد 10  سورة اتلوبة 3 -  ﱡﱞ ﱟ ﱠ ﱡ ﱢ ﱣ ﱠ ذكرت مرة واحدة  ﱡ  ﱁ ﱂ ﱃ ﱄ ﱅﱆ ﱇ ﱈ ﱉ ﱊ ... ﱞ  ﱟ ﱠ ﱡ ﱢ ﱣ ﱠ 4 -  ﱡﱩ ﱪ ﱫﱠ',
        '[]', NULL);


INSERT INTO quran_rules (surah, verse_number, rule, description, examples, category)
VALUES ('التوبة', 9, 
        'ﱡﱾ ﱿ ﲀ ﲁ ﲂﲃﱠوعسى من اهلل', 
        ' ﱦ ﱧﱨ ﱩ ﱪ ﱫ ﱬﱠ 2- ﱡﱁ ﱂ ﱃ ﱄ ﱅ... ﱘ ﱙ ﱚ ﱛﱠ *** - ذكرت خمترصة  ﱡﱩ ﱪ ﱫﱠ يف أعىل الصفحة اليمنى من املصحف (خاص بسورة التوبة). عند احلديث عن اجلنة دون ذكر يشء من نعيمها (أزواج، مساكن، حور عني ...)  يأيت بأقرص صيغة ﱡﱩ ﱪ ﱫﱠ وهذا يف سائر املصحف 5 -  ﱡﲳ ﲴ ﲵ ﲶ ﲷ ﱠ ذكرت مرة واحدة  ﱡ  ﲝ ﲞ ﲟ ﲠ ﲡ ﲢ ﲣ ﲤ  ﲥ ﲦ ﲧ ﲨ ﲩ ﲪ ﲫ ﲬﲭ  ﲮ ﲯ ﲰ ﲱﲲ ﲳ ﲴ ﲵ ﲶ ﲷ  ﱠ والرضوان من اهلل منزلة عالية ناسب تأكيد الفوز بـﱡ ﲴ ﱠ ﱠ آية وفـــــــــــــــــــــــ وائد 11  سورة اتلوبة ﱡﳌ ﳍ ﳎ ﳏ ﳐ ﱠ ذكرت مرة واحدة  ﱡ ﲦ ﲧ ﲨ ﲩ ﲪ ﲫ ﲬ ﲭ ﲮ ﲯﲰ ... ﳌ ﳍ ﳎ ﳏ ﳐﱠ',
        '[]', NULL);


INSERT INTO quran_rules (surah, verse_number, rule, description, examples, category)
VALUES ('التوبة', 27, 
        '', 
        ' 1- ﱡﱁ ﱂ ﱃ ﱄ ﱅ ﱆ ﱇ ﱈ ﱉﱊ ﱋ ﱌ ﱍ ﱎﱠ ﱡﲀ ﲁ ﲂ ﲃ ﲄ ﲅ ﲆ ﲇ ﲈ ﲉ ﲊ ﲋ ﲌ ... ﲙ ﲚ ﲛ ﲜﱠ آية وفـــــــــــــــــــــــ وائد 11  سورة اتلوبة 9 -  ﱡ ﲩ ﲪ ﲫﱠ',
        '[]', NULL);


INSERT INTO quran_rules (surah, verse_number, rule, description, examples, category)
VALUES ('التوبة', 90, 
        'موضع وحيد ذكر يف خامتته حرف (إن).', 
        ' 1- ﱡ ﲚ ﲛ ﲜ ﲝ ﲞ ﲟ ﲠ ﲡ ﲢ ﲣﲤ ﲥ ﲦ ﲧﲨ ﲩ ﲪ ﲫ ﲬﱠ - للضبط:  السني يف كلمة ﱡ ﲧﲨﱠمع السني يف كلمة  ﱡ ﲪﱠ - ملا ذكر اهلل يف اآلية تربص األعراب باملؤمنني ختمها بسمعه وعلمه هبذا الرتبص. *** 2- ﱡﲉ ﲊ ﲋ ﲌ ﲍ ﲎ ﲏ ﲐ ﲑﲒ ﲓ ﲔ ﲕ ﲖﲗ ﲘ ﲙ ﲚ ﲛﱠ - للضبط: السني يف ﱡﲕ ﲖﲗﱠمع السني يف ﱡ ﲙﱠ. - الصالة من الرسول عىل املؤمنني هي دعائه هلم، لذا  ختم اهلل   .اآلية بسمعه هلذا الدعاء 18 -  ﱡ ﱗ ﱘ ﱙ ﱠ ذكرت يف 6  : مواضع يف اآليات 15  ، 20  ، 68  ، 97  ، 186  ، 118  ﱡﱏ ﱐ ﱑ ﱒ ﱓ ﱔ ﱕ ﱖ ﱗ ﱘ ﱙ ﱚ ﱛﱜ ... ﱥ ﱦﱧ ﱨ ﱩ ﱪ ﱫ ﱬ ﱠ ونستطيع ربطها بمالحظة أهنا وافقت ماقبلها ملا قال',
        '[]', NULL);


INSERT INTO quran_rules (surah, verse_number, rule, description, examples, category)
VALUES ('التوبة', 55, 
        '', 
        '',
        '[]', NULL);


INSERT INTO quran_rules (surah, verse_number, rule, description, examples, category)
VALUES ('التوبة', 54, 
        '', 
        ' ﱜ ﱝ ﱞ ﱟﱠ ﱠ،  واملعنى أن ليس لكّل نفس ما يف األرض إنام هو هلل.',
        '[]', NULL);


INSERT INTO quran_rules (surah, verse_number, rule, description, examples, category)
VALUES ('التوبة', 65, 
        'هي: « عني النمل » .   واملقصود كّل سورة يف اسمها حرف', 
        ' ﱥﱦﱠ، فاقتىض لفظ  ﱡﳀ ﳁﱠوكرر، ألن املراد: من يف األرض ههنا، لكوهنم فيها، لكن قدم ذكر  ﱡ ﳀ ﳁ ﳂﱠتعظيام   ، ثم عطف ﱡﳃ ﳄ ﳅﱠعىل ذلك. [  أرسار التكرار يف القرآن 232 ]  ﱡﲌ  ﲍ ﲎ ﲏ ﲐ ﲑ ﲒ ﲓ ﲔﲕ ﲖ ﲗ ﲘ ﲙ ﲚ ﲛ ﲜﱠ   [  :يونس 21 .] ختم اهلل تعاىل ثالث  آيات ملا تكلم عن الليّل بالسمع: يونس  67  ، القصص 71  ، الروم 23 ، أل ن حاسة السمع أهم يف الظالم من البرص، فختمها عز وجّل بام  يناسب حال اإلنسان وضعفه. آية وفـــــــــــــــــــــــ وائد 71  سورة يونس  ﱡﲝ  ﲞ  ﲟ  ﲠﲡ  ﲢﲣ  ﲤ  ﲥﲦ  ﲧ  ﲨ  ﲩ  ﲪ  ﲫ  ﲬ  ﲭﲮ  ﲯ ﲰ ﲱ ﲲ ﲳﲴ ﲵ ﲶ ﲷ ﲸ ﲹ ﲺ ﲻﱠ  [  :يونس 2٢. ]',
        '[]', NULL);


INSERT INTO quran_rules (surah, verse_number, rule, description, examples, category)
VALUES ('التوبة', 2, 
        '', 
        '  ﱡﱹ ﱺ ﱻ ﱼ ﱽ ﱾ ﱿ ﲀﲁ ﲂ ﲃ ﲄ ﲅ ﲆﱠ   [  :هود 2 21 .] - ﱡﱹ ﱠ:  ال يعني األ مر باالستقامة عدم استقامته   ، ولكنه أمر باالستمرار عليها، ومهام بلغ اإلنسان من التقوى فهو بحاجة إىل املزيد. - ﱡﱺ ﱻ ﱠ:  استقامة عىل مراد اهلل وليس كام يريد اإلنسان، كام أمرت تشمّل استقامة القلب واجلوارح. آية وفـــــــــــــــــــــــ وائد 010  سورة هود - ﱡﱿ ﲀﱠ:  بدأ بذكر أوامر هي من لوازم االستقامة، أوهلا عدم جتاوز احلد فيها، لذا قال ﱡﱿ ﲀﱠ  ومل يقّل ( وال تقرصوا)؛  ألن االجتهاد يف االستقامة قد يؤدي إىل التشديد عىل النفس والغلو يف العبادة.',
        '[]', NULL);


INSERT INTO quran_rules (surah, verse_number, rule, description, examples, category)
VALUES ('التوبة', 20, 
        '', 
        ' ﲨ ﲩ ﲪ ﲫ ﲬ ﲭ ﲮ ﲯ ﲰ ﲱ ... ﲺﱠختالف هذا الضبط.  ﱡ ﱳ ﱴ ﱵ ﱶ ﱷ ﱸ ﱹ ﱺ ﱻ ﱼﱽ ﱾ ﱿ ﲀ ﲁ ﲂ ﲃ ﲄ ﲅ ﲆ ﲇ ﲈ ﲉ ﲊ ﲋﱠ   [  :يوسف 15 .] ملَ قال سيدها ومل يقّل سيدمها؟ ألن الكافر ال سيادة له عىل املؤمن ، أو ألنه زوجها فهو سيدها  هي وليس سيدا ليوسف  ، وألن ملكيته ليوسف غري مشوعة، واإلسالم ال  يعرتف باستعباد احلر. [ التفسري املوضوعي  3 / 221 ] آية وفـــــــــــــــــــــــ وائد 016  سورة يوسف  ﱡﲤ ﲥ ﲦ ﲧﲨ ﲩ ﲪ ﲫ ﲬ ﲭ ﲮﲯ ﲰ ﲱ ﲲ ﲳ ﲴ ﲵ ﲶ ﲷ ﲸ ﲹ ﲺﲻ ﲼ ﲽﲾ ﲿ ﳀ ﳁ ﳂ ﳃﱠ   [  :يوسف 42 .] ﱡﲿ ﳀ ﳁ ﳂﱠ  قيلت ليوسف وهو يف السجن، وقيلت له وهو عىل خزائن',
        '[]', NULL);


INSERT INTO quran_rules (surah, verse_number, rule, description, examples, category)
VALUES ('التوبة', 17, 
        '', 
        '  ﱡﱨ ﱩ  ﱪ ﱫ  ﱬ ﱭ ﱮ ﱯ ﱰ ﱱ ﱲ  ﱳ  ﱴ ﱵ ﱶﱷ ﱸ ﱹ ﱺ ﱻ ﱼ ﱽ ﱾ ﱿ ﲀﲁ ﲂ ﲃ ﲄ ﲅ ﲆ ﲇ ﲈ ﲉ ﲊﱠ   [  :يوسف 32 .] وقال بعدها :  ﱡ ... ﲘ ﲙ ﲚ ﲛ ﲜ ﲝ ﲞﲟ ﲠ ﲡ ﲢ ﲣﲤ ﲥ ﲦﲧ ... ﲫﱠ ملا كان يف املوضع األول احلديث ع ن عبادهتم لألصنام ختمت بالعبادة  بقوله: ﱡﱼ ﱽ ﱾ  ﱿ  ﲀﲁ  ﱠ، أما يف املوضع الثاين فكانت عن خوف يعقوب    عىل بنيه من ا لعني فختمت  بالتوكّل عىل اهلل ﱡ ﲥ ﲦﲧ ... ﲫﱠ. آية وفـــــــــــــــــــــــ وائد 017  سورة يوسف  ﱡﲙ ﲚ ﲛ ﲜﲝ ﲞ ﲟ ﲠ ﲡ ﲢ ﲣ ﲤ ﲥ ﲦ ﲧ ﲨ ﲩ ﲪ ﲫﲬ ﲭ ﲮ ﲯ ﲰ ﲱﱠ  [  :يوسف 52 .] قال رسول اهلل   : « نحنُ أ حقُ بالشكِ من إبراهيمَ إذ قال : ﱡﱄ ﱅ ﱆ ﱇ ﱈﱉ',
        '[]', NULL);


INSERT INTO quran_rules (surah, verse_number, rule, description, examples, category)
VALUES ('التوبة', 22, 
        'إذا قال  ﱡﱿ ﱠمل يقّل  ﱡﳦ ﳧﱠ.', 
        '  ﱡﱁ ﱂ ﱃ ﱄ ﱅ ﱆ ﱇ ﱈ ﱉﱊ ﱋ ﱌ ﱍ ﱎ ﱏ ﱐ ﱑ ﱒ ﱓ ﱔ ﱕ ﱖﱠ   [  :يوسف 22 .] جاءت ﱡﲢ- ﱥﱠ+  ﱡ ﲣﱠيف ثالثة مواضع يف املصحف فقط: 1- يوسف : ﱡﱁ ﱂ ﱃ ﱄ ﱅ ﱆ ﱇ ﱈ ﱉﱊ ... ﱖﱠ 2- القصص:  ﱡﲢ ﲣ ﲤ ﲥ ﲦ ﲧ ﲨ ﲩ ﲪ ﲴ...ﳃ ﱠ 3- العنكبوت :  ﱡﱥ ﱦ ﱧ ﱨ ﱩ ﱪ ﱫ ﱬ ﱭ ﱮ ﱯ ...ﱽﱠ آية وفـــــــــــــــــــــــ وائد 001  سورة يوسف  ﱡﱺ ﱻ ﱼ ﱽ ﱾ ﱿ ﲀﲁ ﲂ ﲃ ﲄ ﲅ ﲆ ﲇ ﲈ ﲉ ﲊ ﲋ ﲌﲍ ﲎ ﲏ ﲐ ﲑ ﲒ ﲓ ﲔ ﲕ ﲖ ﲗ ﲘ ﲙ ﲚ ﲛ ﲜ ﲝ ﲞ ﲟ ﲠﲡ ﲢ ﲣ ﲤ ﲥ ﲦﲧ ﲨ ﲩ ﲪ ﲫ ﲬﱠ  [  :يوسف 222 .] -  من كرم أخالق يوسف   مل يذكر خروجه م ن اجلب حتى ال حيرج إخوته  الذين كانوا السبب يف إلقائه فيه ، وألن دخوله السجن وخروجه منه كان باختياره فاخلروج منه',
        '[]', NULL);


INSERT INTO quran_rules (surah, verse_number, rule, description, examples, category)
VALUES ('التوبة', 38, 
        '', 
        ' للضبط:  التاء يف  ﱡت َ و َّكّتَُﱠ  مع التاء يف ﱡم َ تِبَِ ﱠ،  واهلمزة يف  ﱡ َ أد َ عَُو ا َﱠ مع  اهلمزة يف ﱡم َ آبَِ ﱠ.  ﱡﱷ ﱸ ﱹ ﱺﱻ ﱼ ﱽ ﱾ ﱿ ﲀ ﲁ ﲂ ﲃ ﲄ ﲅ ﲆ ﲇ ﲈ ﲉ ﲊ ﲋ ﲌﱠ  [  :الرعد 41 .] - ﱡﱷ ﱸ ﱹ ﱺﱻ ﱠ موضع وحيد يف املواضع املشاهبة له بكلمة ﱡﱹ ﱻ ﱠ. - ﱡﱼ ﱽ ﱾ ﱿ ﲀ ﲁ ﲂ ﲃ ﱠ مشاهبة  هلا موضعان يف البقرة :   ﱡ... ﱋ ﱌ ﱍ ﱎ ﱏ ﱐﱑ ﱒ ﱓ ﱔ ﱕ ﱖ ﱗ ﱘ ﱙ ﱚ ﱛ ﱜ ﱝ ﱞ ﱟﱠﱡ ﱢ ﱠ   ﱡ... ﳄ ﳅ ﳆ ﳇ ﳈﳉ ﳊ ﳋ ﳌ ﳍ ﳎ ﳏ ﳐ ﳑ ﳒ ﳓ ﳔ ﳕ ﳖ ﳗ ﱠ  ﱡ ﲍ ﲎ ﲏ ﲐ ﲑ ﲒ ﲓ ﲔ ﲕﲖ ﲗ ﲘ ﲙ ﲚ ﲛ ﲜ ﲝ ﲞ ﲟﲠ ﲡ ﲢ ﲣ ﲤ ﱠ  [  :الرعد 4٢. ] آية وفـــــــــــــــــــــــ وائد',
        '[]', NULL);


INSERT INTO quran_rules (surah, verse_number, rule, description, examples, category)
VALUES ('التوبة', 34, 
        'اإلعرابية : (تكون) سكنت النون للجزم، وإللتقاء', 
        ' عدا كلمة ﱡﱞ ﱠ. آية وفـــــــــــــــــــــــ وائد 933  سورة احلجر  ﱡ ﲤ ﲥ ﲦ ﲧ ﲨ ﲩﱠ  [  :احلجر٥٤ .] 1- احلجر: ﱡ ﲤ ﲥ ﲦ ﲧ ﲨ ﲩ ﱠ 2- الدخان: ﱡﲆ ﲇ ﲈ ﲉ ﲊ ﲋ ﱠ 3- الذاريات: ﱡ ﱫ ﱬ ﱭ ﲧ ﲨ ﱰ ﱠ 4- الطور: ﱡﱖ ﱗ ﱘ ﱙ ﱚ ﱛ ﱠ 5- القمر: ﱡ ﱚ ﱛ ﱜ ﱝ ﱞ ﱟﱠ 6- املرسالت: ﱡ ﲭ ﲮ ﲯ ﲰ ﲱ ﲲﱠ مع مالحظة تطابق آيتي احلجر والذاريات.  ﱡﲮ ﲯ ﲰ ﲱ ﲲ ﲳ ﲴ ﲵ ﲶ ﲷ ﲸﱠ  [ :احلجر ٤1.] :أخرب عن تالقي قلوهبم وتالقي وجوههم، ويف الصحيحني«  أخالقُهُم عىلى خُلُقِ رجلٍ واحدٍ، عىلى طولِ أبيهم آدمى، ستُونى ذراعًا ». :وأما أخالقهم وقلوهبم، ففي الصحيحني« أوَلُ زُمرةٍ  تلِجُ  اجلنَةى  صُوىرُهم  عىل صورةِ  القمرِ',
        '[]', NULL);


INSERT INTO quran_rules (surah, verse_number, rule, description, examples, category)
VALUES ('التوبة', 41, 
        '', 
        ' ومل يذكر (الناس) ألن اخلطاب قبلها موجه لكفار قريش، فلم يذكر لفظ الناس اجلامع هلم ولغريهم . آية وفـــــــــــــــــــــــ وائد 911  سورة اإلرساء - وآ ية 15  : وردت بعد أفعال وأقوال من ق وم خمصوصني: ﱡ  ﲭ ﲮ ﲯ ... ﲻﱠ،  ﱡﱁ ﱂ ﱃ... ﱏ ﱠ،  ﱡ  ﱌ ﱍ ﱎ ﱏ ﱐ ﱑ ﱒ ﱓ ﱔ ﱕ ﱖ ﱗ ﱘ ﱙ ﱚ ﱛ ﱜ ﱝ ﱞ ﱟ ﱠ، فنا سب تقديم ذكر الناس.  [ كشف املعاين  271 ]  ﱡ  ﲂ ﲃ ﲄ ﲅ ﲆ ﲇ ﲈﲉ ﲊ ﲋ ﲌ ﲍ ﲎ ﲏ ﲐ ﲑ ﲒ ﲓﲔ ﲕ ﲖ ﲗ ﲘﱠ   [  :اإلرساء 44 .] ملاذا ختم اهلل اآلية هبذين االسمني؟ - ﱡ  ﲗ ﱠ:  ألنه حجب عن أسامع  الناس سامع تسبيح الكائنات، وإال لو سمعناه',
        '[]', NULL);


INSERT INTO quran_rules (surah, verse_number, rule, description, examples, category)
VALUES ('التوبة', 55, 
        'الزيادة يف املوضع املتأخر .', 
        ' ﱠ  وباء ﱡ ﱠ.  ﱡﲼ ﲽ ﲾ ﲿ ﳀ ﳁ ﳂ ﳃ ﳄ ﳅ ﱠ [  :اإلرساء 14 ] . فيها دليل عىل شدة افتقار العبد إىل تثبيت اهلل إي اه، وأنه ينبغي له أن ال يزال متملقًا لربه أن يثبته عىل اإليامن، ألن النبي   وهو أكمل اخللق قال اهلل له ذلك . [  قتفسري السعدي 955 ] وكان من  أكثرَ دعاءِ رسولِ اهللِ    « يا  مُقَلِبَ القلوبِ ثَبِتْ قلبي عىل دينِكَ » .  [ صحيح ]  ﱡ  ﳆ ﳇ ﳈ ﳉ ﳊ ﳋ ﳌ ﳍ ﳎ ﳏ ﳐ ﳑ ﳒﱠ   [ اإلرسا ء: 13 .] وقال بعدها  ﱡ...  ﳑ ﳒ ﳓ ﳔ ﳕ ﳖ ﳗ ﳘ ﱠ ﱡ ﳑﱠ: مل ناسبة املعنى أنه لن ينرصه أحد إذا أذاقه اهلل ضعف العذاب . لوضبط:  اربط  الضاد يف ﱡض   عْ ف  ﱠمع  الصاد يف ﱡ  ن  ص  ير ا  ﱠ.',
        '[]', NULL);


INSERT INTO quran_rules (surah, verse_number, rule, description, examples, category)
VALUES ('التوبة', 11, 
        'هي: « عني النمل» .   واملقصود كل سورة يف', 
        ' ﳊﳋﱠختمها  بقوله ﱡﳌ ﳍ ﳎ ﳏ ﳐ ﳑﱠ ألن دخول اجلنة عائد ملشيئة اهلل   .  ﱡﱋ ﱌ ﱍ ﱎ ﱏ ﱐ ﱑ ﱒ ﱓ ﱔ ﱕ ﱖ ﱗ ﱘ ﱙ ﱚﱛ ﱜ ﱝ ﱞ ﱟﱠﱡ ﱢﱠ   [  :احلج57] . 1- البقرة :  ﱡﱁ ﱂ ﱃ ﱄ ﱅ ﱆ ﱇ ﱈ ﱉ ﱊ ﱋ ﲲ...ﱙ ﱠ 2- املائدة :  ﱡﲧ ﲨ ﲩ ﲪ ﲫ ﲬ ﲭ ﲮ ﲯ ﲰ ﲱ ﲲ ... ﲻ ﱠ 3- احلج:  ﱡﱋ  ﱌ  ﱍ  ﱎ  ﱏ  ﱐ  ﱑ  ﱒ  ﱓ ﱔ ... ﱢ ﱠ آية وفـــــــــــــــــــــــ وائد 522  سورة احلج  ﱡﱣ ﱤ ﱥ ﱦ ﱧ ﱨ ﱩ ﱪ ﱫ ﱬ ﱭ ﱮ ﱯ ﱰ ﱱ ﱲ ﱳ ﱴ ﱵ ﱶ ﱷ ﱸ ﱹﱺ ﱻ ﱼ ﱽ ﱾﱿ ﲀ ﲁ ﲂ ﲃ ﲄ ﲅ ﲆﲇ ﲈ ﲉ ﲊ ﲋ ﲌ ﲍ ﲎﱠ  [  :احلج53] . - ﱡﳀ ﳁ ﳂ ﳃ ﳄ ﳅﱠوردت يف أربعة مواضع بتكرر لفظ  ﱡﳀ ﳁ ﱠ: 1- يونس :  ﱡﱰ ﱱ ﱲ ﱳ ﱴ ﱵ ﱶ ﱷﱸﱹ ﱺ ﱻ ﱼ ﱽ...',
        '[]', NULL);


INSERT INTO quran_rules (surah, verse_number, rule, description, examples, category)
VALUES ('التوبة', 2, 
        '', 
        ' ﲿﱠ  ﱡﱁ ﱂ ﱃ ﱄ ﱅ ﱆ ﱇﱠ   [  :الشعراء٧٢٠ ] . احلجر:  ﱡﲎ ﲏ ﲐ ﲑ ﲒ ﲓ ﲔ ﱠ موضع وحيد ﱡﱆ ﱠ،  اربط العني يف ﱡيُمَتّ  عُ ونَ ﱠ  مع العني يف الش عراء. وباقي املواضع ﱡﲎ ﲏ ﲐ ﲑ ﲒ ﲓﱠاحلجر 48  ، الزمر 50  ، غافر 42 . قال رسول اهلل   : «  يؤتى بأنعمِ أ هلِ الدُنيا من أ هلِ النَارِ يوم  القيامةِ في صبغ  يف النَارِ صبغةر ثمَ يقال  يا ابن  آدم  هل رأيت  خريرا قطُ هل مرَ بِك نعيمٌ قطُ فيقول  ال واهللَِ يا ربِ ويؤت ى بأشدِ آية وفـــــــــــــــــــــــ وائد 110  سورة الشعراء النَاسِ بؤسرا يف الدُنيا من أ هلِ اجلنَةِ في صب غ  صبغةر يف اجلنَةِ فيقال  له   يا ابن  آدم  هل رأيت  بؤسرا',
        '[]', NULL);


INSERT INTO quran_rules (surah, verse_number, rule, description, examples, category)
VALUES ('التوبة', 8, 
        'هي: « عني النمل » .   واملقصود كل سورة يف', 
        '  ﱡﱢ ﱣ ﱤ ﱥ ﱦ ﱧ ﱨ ﱩ ﱪ ﱫ ﱬﱠ   [  :النمل5] . 1 - هود :  ﱡﱦ ﱧ ﱨ ﱩ ﱪ ﱫ ﱬ ﱭﱠ 2 - النحل :  ﱡ ... ﲝ ﲞ ﲟ ﲠ ﲡ ﲢ ﲣ ﲤ ﲥ ﲦ ﲧ ﲨﱠ 3 - النمل :  ﱡﱢ ﱣ ﱤ ﱥ ﱦ ﱧ ﱨ ﱩ ﱪ ﱫ ﱬ ﱠ انفردت سورة النحل بلفظ ﱡﭐﲧ ﱠ  وباقي املواضع بقوله  ﱡﱫﱠ للضبط:  نالحظ ختام آية سورة النحل السابقة معتمدة عىل ألف، ﱡﭐﲟ ﱠ فختم هنا بكلمة عىل نفس الوزن ﱡﭐﲧ ﱠ، أما اآليات السابقة يف هود والنمل ال تعتمد عىل ألف. ] درة التنزيل وغرة التأويل ٠13[  ﱡﱭ ﱮ ﱯ ﱰ ﱱ ﱲ ﱳ ﱴﱠ   [  :النمل1] . ﱡﱲ ﱳﱠوردت يف مخس سور: 1- األنعام :  ﱡﭐﱍ ﱎ ﱏ ﱐ ﱑ ﱒﱓﱔ ﱕ ﱖ ﱗﱘ ﱙ ﱚ ﱛ ﱜ ﱝ ﱠ آية وفـــــــــــــــــــــــ وائد',
        '[]', NULL);


INSERT INTO quran_rules (surah, verse_number, rule, description, examples, category)
VALUES ('التوبة', 18, 
        'هي « عني النمل » .   واملقصود كل', 
        '  ﱡﲙ ﲚ ﲛ ﲜ ﲝ ﲞ ﲟ ﲠ ﲡ ﲢ ﱠ   [  :النمل٢٧] . النحل:  ﱡﳃ ﳄ ﳅ ﳆ ﳇ ﳈ ﳉ ﳊ ﳋ ﳌ ﱠ الساكنني -  الواو والنون -  حذفت الواو. - ﱡﳆ ﳇ ﱠ: يف النحل حذفت النون موافقة ملا قبلها  ﱡﱜ ﱝ ﱞ ﱟ ﱠﱠ  وليس إعرابرا. ]  أرسار التكرار يف القرآن 113[ آية وفـــــــــــــــــــــــ وائد 133  سورة انلمل  ﱡﲣ ﲤ ﲥ ﲦ ﲧ ﲨ ﲩ ﲪﱠ   [  :النمل٧1] . آية مطابقة وردت يف ستة مواضع يف املصحف: 1- يونس :  ﱡﲍ ﲎ ﲏ ﲐ ﲑ ﲒ ﲓ ﲔ ﲕ ﲖ ﲗ ﲘ ﲙ ﲚ ﲛ ... ﲭﱠ 2- األنبياء :  ﱡﱝ ﱞ ﱟﱠ ﱡ ﱢ ﱣ ﱤ ﱥ ﱦ ﱧ ﱨ ... ﱵﱠ 3- النمل :  ﱡﲣ ﲤ ﲥ ﲦ ﲧ ﲨ ﲩ ﲪ ﲫ ﲬ ﲭ ﲮ ... ﲴﱠ 4- سبأ :  ﱡﲢ ﲣ ﲤ ﲥ ﲦ ﲧ ﲨ ﲩ ﲪ ﲫ ﲬ ﲭ ... ﲴ ﱠ',
        '[]', NULL);
